narbiscorp/edge-earclip/firmware/sdkconfig.defaults
# Narbis earclip — ESP-IDF defaults.
# Pin: ESP-IDF v5.5.1 (see CLAUDE.md). Do not silently upgrade.

# ---------------- target ----------------
CONFIG_IDF_TARGET="esp32c6"

# ---------------- flash + partition table ----------------
# XIAO ESP32-C6 has 4 MB flash. The partition table assumes that size.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------- Bluetooth (NimBLE host) ----------------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# BLE controller modem-sleep. With this off (default in IDF 5.5), the BT
# controller holds an ESP_PM_CPU_FREQ_MAX lock 100% of the time, pinning
# the CPU at 160 MHz and blocking light sleep entirely (visible in
# esp_pm_dump_locks as "bt CPU_FREQ_MAX 100%"). Turning it on lets the
# controller dropthe lock between conn events. Sleep clock is the main
# XTAL by default (BT_LE_LP_CLK_SRC_MAIN_XTAL) — XIAO C6 has no
# external 32 kHz crystal.
CONFIG_BT_LE_SLEEP_ENABLE=y
# BLE light sleep requires the MAC and Baseband to power down with the
# rest of the system — without this the controller's sleep callback
# can't actually park the radio. Build error if BT_LE_SLEEP_ENABLE is
# set without this.
CONFIG_MAC_BB_PD=y
# Multi-central. Path B accepts 2 simultaneous centrals (dashboard + glasses);
# 3 leaves a slot for a debug client. Both host (NimBLE) and controller
# (LE) caps must be raised — host alone is a footgun (the controller will
# reject the third connect even though the host expected it to fit).
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_LE_MAX_CONNECTIONS=3

# ---------------- Power management ----------------
# Light sleep is the only sleep mode allowed (CLAUDE.md: no deep sleep on the
# earclip — incompatible with continuous sampling). Stage 07 wires up actual
# sleep entry; here we just enable the framework.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# Light-sleep / lock-holder profiling. esp_pm_dump_locks() prints which
# component is holding the CPU/APB at MAX. Enabled while we hunt down
# why average current is far above target.
CONFIG_PM_PROFILING=y
CONFIG_PM_DFS_INIT_AUTO=y
# Track total time spent in light sleep so we can verify it's actually
# entering. esp_pm_get_sleep_stats() (or the dump_locks output) reports it.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# ---------------- Logging ----------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ---------------- Battery sense ----------------
# CI release binaries assume the 1 MΩ : 1 MΩ resistor divider is
# soldered (or breadboarded) on every Narbis earclip board, BAT+ →
# GPIO1 → GND, so power_mgmt_get_battery() reads real voltage instead
# of returning the 4000 mV / 80% stub. Boards without the divider will
# read random floating-pin values; for a fresh out-of-the-box XIAO,
# manually flip this back to n in a local `idf.py menuconfig` run
# before flashing.
#
# Calibration uses slope + offset so it matches the actual ADC behavior
# at multiple voltages. A single ratio (the prior 33/16) was correct at
# 4.00 V but drifted ~50 mV low at 3.70 V because the ESP32-C6 ADC has
# a small bias that isn't proportional to input voltage. Solving across
# both bench points:
#   4.00 V supply → ADC ≈ 1940 mV at the pin
#   3.70 V supply → ADC ≈ 1770 mV at the pin
#   linear fit: final_mv = (adc_mv * 30 / 17) + 576
#   verifies: 1940*30/17+576 = 4000, 1770*30/17+576 = 3700 ✓
# A future PR moves these into narbis_runtime_config_t (NVS-persisted,
# dashboard-tweakable, OTA-survivable) so each board can keep its own
# 2-point trim — until then this is the project default.
CONFIG_NARBIS_BATT_DIVIDER_PRESENT=y
CONFIG_NARBIS_BATT_ADC_GPIO=1
CONFIG_NARBIS_BATT_ADC_DIV_NUM=30
CONFIG_NARBIS_BATT_ADC_DIV_DEN=17
CONFIG_NARBIS_BATT_ADC_OFFSET_MV=576
